#+AUTHOR: Einar Elén
#+EMAIL: einar.elen@gmail.com
#+OPTIONS: toc:3 html5-fancy:t org-html-preamble:nil
#+HTML_DOCTYPE_HTML5: t
#+PROPERTY: header-args :tangle yes :noweb yes :comments both
#+STARTUP: noinlineimages
** Intro 
#+BEGIN_SRC emacs-lisp
  (require 'map "/home/einarelen/.local/share/emacs/27.0.50/lisp/emacs-lisp/map.el")
(tool-bar-mode -1)
  (scroll-bar-mode -1)
  (global-display-line-numbers-mode)
  (add-to-list 'load-path elib-external-lisp-dir)
  (use-package tramp
    :defer t
    :config
    (setq tramp-default-method "ssh"))
  (setq backup-directory-alist `((".*" . ,temporary-file-directory))
    auto-save-file-name-transforms `((".*" ,temporary-file-directory t))
    backup-by-copying t    ;; Don't delink hard-links
    version-control t      ;; use version numbers on backups
    delete-old-versions t  ;; Automatically delete excess backups
    kept-new-versions 20   ;; how many of the newest versions to keep
    kept-old-versions 5    ;; and how many of the old
    )
#+END_SRC

#+RESULTS:
: 5

** Applications 
#+NAME: general-applications
#+BEGIN_SRC emacs-lisp :tangle no 
  (elib-leader-apps-def
    "c" '(calc-dispatch :wk "Calc Dispatch")
    "d" '(dired :wk "Dired")
    "P" '(nil :wk "Processes")
    "Pp" '(proced :wk "Proced")
    "Pl" '(list-processes :wk "List Processes")
    "lp" '(package-list-packages :wk "List packages")
    "m" '(nil :wk "Mu4e")
    "mm" '(mu4e :wk "Mu4e")
    "mc" '(mu4e-compose-new :wk "Compose")
    "t" '(twit :wk "Twitter"))

  (elib-leader-shells-def
    "'" '(spacemacs/default-pop-shell :wk "Shell")
    "e" '(spacemacs/shell-pop-eshell :wk "Eshell")
    "s" '(spacemacs/shell-pop-shell :wk "Shell")
    "m" '(spacemacs/shell-pop-multi-term :wk "Multi term")
    "t" '(spacemacs/shell-pop-ansi-term :wk "Ansi-term")
    "T" '(spacemacs/shell-pop-term :wk "Term")
    )
    
  (elib-leader-a/org-def
    "c" '(nil :wk "Capture and Calendar")
    "cs" '(org-caldav-sync :wk "Sync Calendar")
    "co" '(elib-open-calendar :wk "Calendar")
    "cc" '(org-capture :wk "Capture")
    "a" '(org-agenda :wk "Agenda")
    "s" '(nil :wk "Store")
    "sl" '(org-store-link :wk "Store Link")
    )
  (elib-leader-org-brain-def
    "" '(nil :wk "Brain")
    "v" '(org-brain-visualize :wk "Visualize")
    "c" '(org-brain-add-child :wk "Add Child")
    "f" '(org-brain-add-friend :wk "Add Friend")
    "p" '(org-brain-add-parent :wk "Add Parent")
    "l" '(org-brain-add-resource-link :wk "Add Link/Resource")
    "d" '(org-brain-delete-entry :wk "Delete Entry"))
  (elib-leader-org-ref-def
  "l" '(nil :wk "Lookup")
   "la" '(arxiv-get-pdf-add-bibtex-entry :wk "Arxiv Get Bibtex and Pdf")
   "ld" '(doi-utils-add-bibtex-entry-from-doi :wk "DOI Get Bibtex")
   "li" '(isbn-to-bibtex :wk "ISBN Get Bibtex")
   "n" '(helm-bibtex :wk "Choose citation")
   "." '(org-ref-bibtex-hydra/body :wk "Transient")
   "i" '(nil :wk "Insert")
   "il" '(org-ref-helm-insert-label-link :wk "Label")
   "ir" '(org-ref-helm-insert-ref-link :wk "Ref")
   "ic" '(org-ref-helm-insert-cite-link :wk "Cite")
   "ib" '(org-ref-insert-bibliography-link  :wk "Bibliography")
   "is" '(org-ref-insert-bibliographystyle-link  :wk "Bibliography Style")
   "if" '(org-footnote-action :wk "Footnote")
   "iC" '(doi-utils-add-entry-from-crossref-query :wk "Crossref")
   )

  (unbind-key "<f12>")
  (unbind-key "<f6>")
  (unbind-key "<f8>")
  (unbind-key "<f7>")
#+END_SRC

#+RESULTS: general-applications
| (C-s . helm-swoop-map)          | helm-next-line                         | undefined                |
| (C-r . helm-swoop-map)          | helm-previous-line                     | nil                      |
| (s . mu4e-view-mode-map)        | helm-mu                                | helm-mu                  |
| (c . mu4e-headers-mode-map)     | helm-mu-contacts                       | helm-mu-contacts         |
| (s . mu4e-headers-mode-map)     | helm-mu                                | helm-mu                  |
| (C-M-c . mu4e-org-mode-map)     | helm-mu-contacts                       | helm-mu-contacts         |
| (C-M-c . mu4e-compose-mode-map) | helm-mu-contacts                       | helm-mu-contacts         |
| (c . mu4e-main-mode-map)        | helm-mu-contacts                       | helm-mu-contacts         |
| (s . mu4e-main-mode-map)        | helm-mu                                | helm-mu                  |
| (C-:)                           | helm-company                           | nil                      |
| (C-w)                           | spacemacs/backward-kill-word-or-region | kill-region              |
| (C-e)                           | mwim-end                               | move-end-of-line         |
| (C-a)                           | mwim-beginning                         | move-beginning-of-line   |
| (C-x C-U)                       | undo-tree-visualize                    | upcase-region            |
| (M-;)                           | comment-dwim-2                         | comment-dwim             |
| (C-k . org-mode-map)            | elib-kill-line-org-sp                  | nil                      |
| (C-c y x)                       | yas-expand                             | nil                      |
| (C-c y r)                       | yas-reload-all                         | nil                      |
| (C-c y m)                       | yas/minor-mode                         | nil                      |
| (C-c y g)                       | yas/global-mode                        | nil                      |
| (C-c y l)                       | yas-describe-tables                    | nil                      |
| (C-c y t)                       | yas-tryout-snippet                     | nil                      |
| (C-c y n)                       | yas-new-snippet                        | nil                      |
| (C-c y f)                       | yas-visit-snippet-file                 | nil                      |
| (C-c y i)                       | yas-insert-snippet                     | nil                      |
| (C-c y d)                       | yas-load-directory                     | nil                      |
| (<f10>)                         | helm-themes                            | menu-bar-open            |
| (M-n . minibuffer-local-map)    | helm-minibuffer-history                | next-history-element     |
| (M-p . minibuffer-local-map)    | helm-minibuffer-history                | previous-history-element |
| (C-h SPC)                       | helm-all-mark-rings                    | nil                      |
| (M-y)                           | helm-show-kill-ring                    | yank-pop                 |
| (<f9>)                          | eshell-here                            | nil                      |
| (<f7>)                          | nil                                    | nil                      |
| (<f8>)                          | nil                                    | org-caldav-sync          |
| (<f6>)                          | nil                                    | elib-open-calendar       |
| (<f12>)                         | nil                                    | mu4e                     |
| (C-h h)                         | nil                                    | view-hello-file          |

** Mail Update this one
#+BEGIN_SRC emacs-lisp
(defun get-string-from-file (filePath)
  "Return filePath's file content."
  (with-temp-buffer
    (insert-file-contents filePath)
    (buffer-string)))
(defvar elib-info-signature-file (potential-load-paths '("~/.emacs.d/files/info-signature.org")) )
(defun my-mu4e-choose-signature ()
  "Insert one of a number of sigs"
  (interactive)
  (let
      ((message-signature
        (mu4e-read-option
         "Signature:"
         `(("info" .
            ,(get-string-from-file elib-info-signature-file))
           ("swan" .
            "Einar Elén
Secretary of the steering group (SWAN)
")))))
    (message-insert-signature)
(org-mime-htmlize)
))

;; make the `gnus-dired-mail-buffers' function also work on
;; message-mode derived modes, such as mu4e-compose-mode
(defun gnus-dired-mail-buffers ()
  "Return a list of active message buffers."
  (let (buffers)
    (save-current-buffer
      (dolist (buffer (buffer-list t))
        (set-buffer buffer)
        (when (and (derived-mode-p 'message-mode)
                (null message-sent-message-via))
          (push (buffer-name buffer) buffers))))
    (nreverse buffers)))

(setq gnus-dired-mail-mode 'mu4e-user-agent)
(add-hook 'dired-mode-hook 'turn-on-gnus-dired-mode)


(defun elib-mu4e-view-request-attachments-dir (path)
        "Ask the user where to save multiple attachments (default is PATH)."
         (let ((fpath (expand-file-name
                      (read-directory-name
                       (mu4e-format "Save in directory ")
                       path nil nil nil) path)))
          (if (file-directory-p fpath)
              fpath
            (if elib-create-attachments-directories?
                (progn (mkdir fpath t) fpath) ) )))

    (defun choose-msmtp-account ()
        (if (message-mail-p)
            (save-excursion
              (let*
                  ((from (save-restriction
                           (message-narrow-to-headers)
                           (message-fetch-field "from")))
                   (case-fold-search t)
                   (account
                    (cond
                     ((string-match "gmail.com" from) "gmail")
                     ((string-match "student.lu.se" from) "lu")
                     ((string-match "luna.lu.se" from) "jol")
                     ((string-match "cern.ch" from) "cern")
                     )))
                (setq message-sendmail-extra-arguments (list '"-a" account))))))
      (defun my-mu4e-set-account ()
        "Set the account for composing a message."
        (let* ((account
                (if mu4e-compose-parent-message
                    (let ((maildir (mu4e-message-field mu4e-compose-parent-message :maildir)))
                      (string-match "/\\(.*?\\)/" maildir)
                      (match-string 1 maildir))
                  (completing-read (format "Compose with account: (%s) "
                                           (mapconcat #'(lambda (var) (car var))
                                                      my-mu4e-account-alist "/"))
                                   (mapcar #'(lambda (var) (car var)) my-mu4e-account-alist)
                                   nil t nil nil (caar my-mu4e-account-alist))))
               (account-vars (cdr (assoc account my-mu4e-account-alist))))
          (if account-vars
              (mapc #'(lambda (var)
                        (set (car var) (cadr var)))
                    account-vars)
            (error "No email account found"))))
 (defvar elib-create-attachments-directories? t)
  (defalias 'mu4e~view-request-attachments-dir 'elib-mu4e-view-request-attachments-dir)
#+END_SRC

#+RESULTS:
: mu4e~view-request-attachments-dir

** Pdf tools
#+BEGIN_SRC emacs-lisp
  (defun elib-disable-line-numbers ()
    (interactive)
    (display-line-numbers-mode -1))

  (use-package pdf-tools
    :defer nil
    :mode ("\\.pdf\\'" . pdf-view-mode)
    :config

    (add-hook 'image-mode-hook 'elib-disable-line-numbers)
    (add-hook 'pdf-view-mode-hook 'elib-disable-line-numbers)

    (general-def :keymaps 'pdf-view-mode-map
      "/" '(pdf-occur :wk "Search")
      "M-m /" '(pdf-occur :wk "Search")
      )
    (setq-default pdf-view-display-size 'fit-page)
    (setq  pdf-annot-activate-created-annotations t)
    (setq pdf-view-resize-factor 1.1)
    (use-package pdf-annot
      :ensure nil)
    (use-package org-pdfview)
    
  (setq org-file-apps
    '(("\\.docx\\'" . emacs)
      ("\\.mm\\'" . default)
      ("\\.x?html?\\'" . default)
      ("\\.pdf\\'" . emacs)
      (auto-mode . emacs)))

    ;(use-package org-pdftools)
    )
#+END_SRC 

#+RESULTS:
: ((\.pdf\' . pdf-view-mode) (\.hva\' . latex-mode) (\.drv\' . latex-mode) (/guix/drvs/[[:alnum:]]\{2\}/[[:alnum:]]\{30\}-\(?:[+._[:alnum:]-]+\)\.drv\' . guix-build-log-mode) (/gnu/store/\(?:[+._[:alnum:]-]+\)\.drv\' . guix-derivation-mode) (/etc/profile\' . guix-env-var-mode) (/tmp/guix-build-\(?:[+._[:alnum:]-]+\)\.drv-[[:digit:]]+/environment-variables\' . guix-env-var-mode) (/guix/profiles/system\(?:[+._[:alnum:]-]+\)*/\(?:boot\|parameters\)\' . guix-scheme-mode) (/gnu/store/\(?:[0-9a-df-np-sv-z]\{32\}\)-\(?:activate\|activate-service\|boot\|parameters\|shepherd\.conf\|shepherd\(?:[+._[:alnum:]-]+\)\.scm\|\(?:[+._[:alnum:]-]+\)-guile-builder\)\' . guix-scheme-mode) (\.rkt\' . scheme-mode) (\.md\' . markdown-mode) (\.markdown\' . markdown-mode) (/git-rebase-todo\' . git-rebase-mode) (\.gpg\(~\|\.~[0-9]+~\)?\' nil epa-file) (\.\(?:3fr\|a\(?:rw\|vs\)\|bmp[23]?\|c\(?:als?\|myka?\|r[2w]\|u[rt]\)\|d\(?:c[mrx]\|ds\|jvu\|ng\|px\)\|exr\|f\(?:ax\|its\)\|gif\(?:87\)?\|hrz\|ic\(?:on\|[bo]\)\|j\(?:2c\|ng\|p\(?:eg\|[2cg]\)\)\|k\(?:25\|dc\)\|m\(?:iff\|ng\|rw\|s\(?:l\|vg\)\|tv\)\|nef\|o\(?:rf\|tb\)\|p\(?:bm\|c\(?:ds\|[dltx]\)\|db\|ef\|gm\|i\(?:ct\|x\)\|jpeg\|n\(?:g\(?:24\|32\|8\)\|[gm]\)\|pm\|sd\|tif\|wp\)\|r\(?:a[fs]\|gb[ao]?\|l[ae]\)\|s\(?:c[rt]\|fw\|gi\|r[2f]\|un\|vgz?\)\|t\(?:ga\|i\(?:ff\(?:64\)?\|le\|m\)\|tf\)\|uyvy\|v\(?:da\|i\(?:car\|d\|ff\)\|st\)\|w\(?:bmp\|pg\)\|x\(?:3f\|bm\|cf\|pm\|wd\|[cv]\)\|y\(?:cbcra?\|uv\)\)\' . image-mode) (\.elc\' . elisp-byte-code-mode) (\.zst\' nil jka-compr) (\.dz\' nil jka-compr) (\.xz\' nil jka-compr) (\.lzma\' nil jka-compr) (\.lz\' nil jka-compr) (\.g?z\' nil jka-compr) (\.bz2\' nil jka-compr) (\.Z\' nil jka-compr) (\.vr[hi]?\' . vera-mode) (\(?:\.\(?:rbw?\|ru\|rake\|thor\|jbuilder\|rabl\|gemspec\|podspec\)\|/\(?:Gem\|Rake\|Cap\|Thor\|Puppet\|Berks\|Vagrant\|Guard\|Pod\)file\)\' . ruby-mode) (\.re?st\' . rst-mode) (\.py[iw]?\' . python-mode) (\.m\' . octave-maybe-mode) (\.less\' . less-css-mode) (\.scss\' . scss-mode) (\.awk\' . awk-mode) (\.\(u?lpc\|pike\|pmod\(\.in\)?\)\' . pike-mode) (\.idl\' . idl-mode) (\.java\' . java-mode) (\.m\' . objc-mode) (\.ii\' . c++-mode) (\.i\' . c-mode) (\.lex\' . c-mode) (\.y\(acc\)?\' . c-mode) (\.h\' . c-or-c++-mode) (\.c\' . c-mode) (\.\(CC?\|HH?\)\' . c++-mode) (\.[ch]\(pp\|xx\|\+\+\)\' . c++-mode) (\.\(cc\|hh\)\' . c++-mode) (\.\(bat\|cmd\)\' . bat-mode) (\.[sx]?html?\(\.[a-zA-Z_]+\)?\' . mhtml-mode) (\.svgz?\' . image-mode) (\.svgz?\' . xml-mode) (\.x[bp]m\' . image-mode) (\.x[bp]m\' . c-mode) (\.p[bpgn]m\' . image-mode) (\.tiff?\' . image-mode) (\.gif\' . image-mode) (\.png\' . image-mode) (\.jpe?g\' . image-mode) (\.te?xt\' . text-mode) (\.[tT]e[xX]\' . tex-mode) (\.ins\' . tex-mode) (\.ltx\' . latex-mode) (\.dtx\' . doctex-mode) (\.org\' . org-mode) (\.el\' . emacs-lisp-mode) (Project\.ede\' . emacs-lisp-mode) (\.\(scm\|stk\|ss\|sch\)\' . scheme-mode) (\.l\' . lisp-mode) (\.li?sp\' . lisp-mode) (\.[fF]\' . fortran-mode) (\.for\' . fortran-mode) (\.p\' . pascal-mode) (\.pas\' . pascal-mode) (\.\(dpr\|DPR\)\' . delphi-mode) (\.ad[abs]\' . ada-mode) (\.ad[bs].dg\' . ada-mode) (\.\([pP]\([Llm]\|erl\|od\)\|al\)\' . perl-mode) (Imakefile\' . makefile-imake-mode) (Makeppfile\(?:\.mk\)?\' . makefile-makepp-mode) (\.makepp\' . makefile-makepp-mode) (\.mk\' . makefile-gmake-mode) (\.make\' . makefile-gmake-mode) ([Mm]akefile\' . makefile-gmake-mode) (\.am\' . makefile-automake-mode) (\.texinfo\' . texinfo-mode) (\.te?xi\' . texinfo-mode) (\.[sS]\' . asm-mode) (\.asm\' . asm-mode) (\.css\' . css-mode) (\.mixal\' . mixal-mode) (\.gcov\' . compilation-mode) (/\.[a-z0-9-]*gdbinit . gdb-script-mode) (-gdb\.gdb . gdb-script-mode) ([cC]hange\.?[lL]og?\' . change-log-mode) ([cC]hange[lL]og[-.][0-9]+\' . change-log-mode) (\$CHANGE_LOG\$\.TXT . change-log-mode) (\.scm\.[0-9]*\' . scheme-mode) (\.[ckz]?sh\'\|\.shar\'\|/\.z?profile\' . sh-mode) (\.bash\' . sh-mode) (\(/\|\`\)\.\(bash_\(profile\|history\|log\(in\|out\)\)\|z?log\(in\|out\)\)\' . sh-mode) (\(/\|\`\)\.\(shrc\|zshrc\|m?kshrc\|bashrc\|t?cshrc\|esrc\)\' . sh-mode) (\(/\|\`\)\.\([kz]shenv\|xinitrc\|startxrc\|xsession\)\' . sh-mode) (\.m?spec\' . sh-mode) (\.m[mes]\' . nroff-mode) (\.man\' . nroff-mode) (\.sty\' . latex-mode) (\.cl[so]\' . latex-mode) (\.bbl\' . latex-mode) (\.bib\' . bibtex-mode) (\.bst\' . bibtex-style-mode) (\.sql\' . sql-mode) (\(acinclude\|aclocal\|acsite\)\.m4\' . autoconf-mode) (\.m[4c]\' . m4-mode) (\.mf\' . metafont-mode) (\.mp\' . metapost-mode) (\.vhdl?\' . vhdl-mode) (\.article\' . text-mode) (\.letter\' . text-mode) (\.i?tcl\' . tcl-mode) (\.exp\' . tcl-mode) (\.itk\' . tcl-mode) (\.icn\' . icon-mode) (\.sim\' . simula-mode) (\.mss\' . scribe-mode) (\.f9[05]\' . f90-mode) (\.f0[38]\' . f90-mode) (\.indent\.pro\' . fundamental-mode) (\.\(pro\|PRO\)\' . idlwave-mode) (\.srt\' . srecode-template-mode) (\.prolog\' . prolog-mode) (\.tar\' . tar-mode) (\.\(arc\|zip\|lzh\|lha\|zoo\|[jew]ar\|xpi\|rar\|cbr\|7z\|ARC\|ZIP\|LZH\|LHA\|ZOO\|[JEW]AR\|XPI\|RAR\|CBR\|7Z\)\' . archive-mode) (\.oxt\' . archive-mode) (\.\(deb\|[oi]pk\)\' . archive-mode) (\`/tmp/Re . text-mode) (/Message[0-9]*\' . text-mode) (\`/tmp/fol/ . text-mode) (\.oak\' . scheme-mode) (\.sgml?\' . sgml-mode) (\.x[ms]l\' . xml-mode) (\.dbk\' . xml-mode) (\.dtd\' . sgml-mode) (\.ds\(ss\)?l\' . dsssl-mode) (\.js[mx]?\' . javascript-mode) (\.har\' . javascript-mode) (\.json\' . javascript-mode) (\.[ds]?va?h?\' . verilog-mode) (\.by\' . bovine-grammar-mode) (\.wy\' . wisent-grammar-mode) ([:/\]\..*\(emacs\|gnus\|viper\)\' . emacs-lisp-mode) (\`\..*emacs\' . emacs-lisp-mode) ([:/]_emacs\' . emacs-lisp-mode) (/crontab\.X*[0-9]+\' . shell-script-mode) (\.ml\' . lisp-mode) (\.ld[si]?\' . ld-script-mode) (ld\.?script\' . ld-script-mode) (\.xs\' . c-mode) (\.x[abdsru]?[cnw]?\' . ld-script-mode) (\.zone\' . dns-mode) (\.soa\' . dns-mode) (\.asd\' . lisp-mode) (\.\(asn\|mib\|smi\)\' . snmp-mode) (\.\(as\|mi\|sm\)2\' . snmpv2-mode) (\.\(diffs?\|patch\|rej\)\' . diff-mode) (\.\(dif\|pat\)\' . diff-mode) (\.[eE]?[pP][sS]\' . ps-mode) (\.\(?:PDF\|DVI\|OD[FGPST]\|DOCX?\|XLSX?\|PPTX?\|pdf\|djvu\|dvi\|od[fgpst]\|docx?\|xlsx?\|pptx?\)\' . doc-view-mode-maybe) (configure\.\(ac\|in\)\' . autoconf-mode) (\.s\(v\|iv\|ieve\)\' . sieve-mode) (BROWSE\' . ebrowse-tree-mode) (\.ebrowse\' . ebrowse-tree-mode) (#\*mail\* . mail-mode) (\.g\' . antlr-mode) (\.mod\' . m2-mode) (\.ses\' . ses-mode) (\.docbook\' . sgml-mode) (\.com\' . dcl-mode) (/config\.\(?:bat\|log\)\' . fundamental-mode) (/\.\(authinfo\|netrc\)\' . authinfo-mode) (\.\(?:[iI][nN][iI]\|[lL][sS][tT]\|[rR][eE][gG]\|[sS][yY][sS]\)\' . conf-mode) (\.la\' . conf-unix-mode) (\.ppd\' . conf-ppd-mode) (java.+\.conf\' . conf-javaprop-mode) (\.properties\(?:\.[a-zA-Z0-9._-]+\)?\' . conf-javaprop-mode) (\.toml\' . conf-toml-mode) (\.desktop\' . conf-desktop-mode) (\`/etc/\(?:DIR_COLORS\|ethers\|.?fstab\|.*hosts\|lesskey\|login\.?de\(?:fs\|vperm\)\|magic\|mtab\|pam\.d/.*\|permissions\(?:\.d/.+\)?\|protocols\|rpc\|services\)\' . conf-space-mode) (\`/etc/\(?:acpid?/.+\|aliases\(?:\.d/.+\)?\|default/.+\|group-?\|hosts\..+\|inittab\|ksysguarddrc\|opera6rc\|passwd-?\|shadow-?\|sysconfig/.+\)\' . conf-mode) ([cC]hange[lL]og[-.][-0-9a-z]+\' . change-log-mode) (/\.?\(?:gitconfig\|gnokiirc\|hgrc\|kde.*rc\|mime\.types\|wgetrc\)\' . conf-mode) (/\.\(?:enigma\|gltron\|gtk\|hxplayer\|net\|neverball\|qt/.+\|realplayer\|scummvm\|sversion\|sylpheed/.+\|xmp\)rc\' . conf-mode) (/\.\(?:gdbtkinit\|grip\|orbital/.+txt\|rhosts\|tuxracer/options\)\' . conf-mode) (/\.?X\(?:default\|resource\|re\)s\> . conf-xdefaults-mode) (/X11.+app-defaults/\|\.ad\' . conf-xdefaults-mode) (/X11.+locale/.+/Compose\' . conf-colon-mode) (/X11.+locale/compose\.dir\' . conf-javaprop-mode) (\.~?[0-9]+\.[0-9][-.0-9]*~?\' nil t) (\.\(?:orig\|in\|[bB][aA][kK]\)\' nil t) ([/.]c\(?:on\)?f\(?:i?g\)?\(?:\.[a-zA-Z0-9._-]+\)?\' . conf-mode-maybe) (\.[1-9]\' . nroff-mode) (\.art\' . image-mode) (\.avs\' . image-mode) (\.bmp\' . image-mode) (\.cmyk\' . image-mode) (\.cmyka\' . image-mode) (\.crw\' . image-mode) (\.dcr\' . image-mode) (\.dcx\' . image-mode) (\.dng\' . image-mode) (\.dpx\' . image-mode) (\.fax\' . image-mode) (\.hrz\' . image-mode) (\.icb\' . image-mode) (\.icc\' . image-mode) (\.icm\' . image-mode) (\.ico\' . image-mode) (\.icon\' . image-mode) (\.jbg\' . image-mode) (\.jbig\' . image-mode) (\.jng\' . image-mode) (\.jnx\' . image-mode) (\.miff\' . image-mode) (\.mng\' . image-mode) (\.mvg\' . image-mode) (\.otb\' . image-mode) (\.p7\' . image-mode) (\.pcx\' . image-mode) (\.pdb\' . image-mode) (\.pfa\' . image-mode) (\.pfb\' . image-mode) (\.picon\' . image-mode) (\.pict\' . image-mode) (\.rgb\' . image-mode) (\.rgba\' . image-mode) (\.tga\' . image-mode) (\.wbmp\' . image-mode) (\.webp\' . image-mode) (\.wmf\' . image-mode) (\.wpg\' . image-mode) (\.xcf\' . image-mode) (\.xmp\' . image-mode) (\.xwd\' . image-mode) (\.yuv\' . image-mode) (\.tgz\' . tar-mode) (\.tbz2?\' . tar-mode) (\.txz\' . tar-mode) (\.tzst\' . tar-mode))

** Latex fragments  

   #+BEGIN_SRC emacs-lisp 
    (setq org-preview-latex-default-process 'imagemagick ; 'dvipng
      )
    (defun org--list-latex-overlays (&optional beg end)
      "List all Org LaTeX overlays in current buffer.
    Limit to overlays between BEG and END when those are provided."
      (org-remove-if-not
       (lambda (o) (eq (overlay-get o 'org-overlay-type) 'org-latex-overlay))
       (overlays-in (or beg (point-min)) (or end (point-max)))))

    (defvar org-latex-fragment-last nil
      "Holds last fragment/environment you were on.")

    (defun org-latex-fragment-toggle ()
      "Toggle a latex fragment image "
      (interactive)
      (and (eq 'org-mode major-mode)
       (let* ((el (org-element-context))
          (el-type (car el)))
         (save-excursion (cond
          ;; were on a fragment and now on a new fragment
          ((and
        ;; fragment we were on
        org-latex-fragment-last
        ;; and are on a fragment now
        (or
         (eq 'latex-fragment el-type)
         (eq 'latex-environment el-type))
        ;; but not on the last one this is a little tricky. as you edit the
        ;; fragment, it is not equal to the last one. We use the begin
        ;; property which is less likely to change for the comparison.
        (not (= (org-element-property :begin el)
            (org-element-property :begin org-latex-fragment-last))))
           ;; go back to last one and put image back
           (save-excursion
         (goto-char (org-element-property :begin org-latex-fragment-last))
         (org-preview-latex-fragment))
           ;; now remove current image
           (goto-char (org-element-property :begin el))
           (let ((ov (cl-loop for ov in (org--list-latex-overlays)
                   if
                   (and
                (<= (overlay-start ov) (point))
                (>= (overlay-end ov) (point)))
                   return ov)))
         (when ov
           (delete-overlay ov)))
           ;; and save new fragment
           (setq org-latex-fragment-last el))

          ;; were on a fragment and now are not on a fragment
          ((and
        ;; not on a fragment now
        (not (or
              (eq 'latex-fragment el-type)
              (eq 'latex-environment el-type)))
        ;; but we were on one
        org-latex-fragment-last)
           ;; put image back on
           (save-excursion
         (goto-char (org-element-property :begin org-latex-fragment-last))
         (org-preview-latex-fragment))
           ;; unset last fragment
           (setq org-latex-fragment-last nil))

          ;; were not on a fragment, and now are
          ((and
        ;; we were not one one
        (not org-latex-fragment-last)
        ;; but now we are
        (or
         (eq 'latex-fragment el-type)
         (eq 'latex-environment el-type)))
           (goto-char (org-element-property :begin el))
           ;; remove image
           (let ((ov (cl-loop for ov in (org--list-latex-overlays)
                   if
                   (and
                (<= (overlay-start ov) (point))
                (>= (overlay-end ov) (point)))
                   return ov)))
         (when ov
           (delete-overlay ov)))
           (setq org-latex-fragment-last el))))
         )))

    (defun org-latex-auto-on ()
      (interactive)
      (add-hook 'org-mode-hook
        (add-hook 'post-command-hook 'org-latex-fragment-toggle)))

    (defun org-latex-auto-off ()
      (interactive)
      (add-hook 'org-mode-hook
        (remove-hook 'post-command-hook 'org-latex-fragment-toggle)))

    (setq org-startup-with-latex-preview nil)
    (add-hook 'post-command-hook 'org-latex-fragment-toggle)


  #+END_SRC

  #+RESULTS:
  | org-latex-fragment-toggle | winner-save-old-configurations | sp--post-command-hook-handler | flycheck-pos-tip-hide-messages | golden-ratio--post-command-hook |

* Frame purpose 

#+BEGIN_SRC emacs-lisp
  (add-to-list 'default-frame-alist '(fullscreen . maximized)) 
  (use-package frame-purpose
    :config
    ;; (frame-purpose-make-frame
    ;;    :directory "/home/einarelen/nextcloud/latex/ASTC01_Astrobiology/"
    ;;    :title "ASTC01"
    ;;    :sidebar 'right 
    ;; )
    )

  ;; olriginal has a typo

  (setq elib-frame-workflow-dir (concat elib-external-lisp-dir "frame-workflow/"))
  (use-package frame-workflow
    :load-path elib-frame-workflow-dir
    :config
    (frame-workflow-mode 1)
    (require 'helm-frame-workflow)
    (elib-leader-def
      "g" 'frame-workflow-prefix-map
      "." 'helm-frame-workflow
      )
    (defun elib-do-projectile-frame-and-helm (&optional dir)
      (interactive)
      (frame-workflow-switch-directory-frame dir)
      (helm-projectile)
      )
    (setq projectile-switch-project-action #'elib-do-projectile-frame-and-helm)
    (spaceline-define-segment frame-workflow
      "The current frame-workflow subject."
      (when-let ((subject (frame-workflow--frame-subject-name)))
    (format "%s %s"
        (propertize (all-the-icons-octicon "browser" :v-adjust 0)
                'face `(:family ,(all-the-icons-octicon-family)
                        :height ,(spaceline-all-the-icons--height 1.1)
                        :inherit))
        (propertize subject 'face '(:height 0.8 :inherit))))
      :tight t
      :when (bound-and-true-p frame-workflow-mode))
    (spaceline-all-the-icons-theme 'frame-workflow)
    )


  


#+END_SRC

#+RESULTS:
: #<buffer configuration.org>

